#define _CRT_SECURE_NO_WARNINGS 
#include <stdio.h>
#include <locale.h>
#include <math.h>

#define UCL 63.83 // верхняя граница Q

int main(void)
{
    setlocale(LC_CTYPE, "UTF-8");

    double x; // показание датчика
    double Q; // индикатор процесса
    int state; // состояние датчика
    int i; // счётчик цикла

    printf("----------------------------------МОНИТОРИНГ ДАВЛЕНИЯ РУБАШКИ----------------------------------\n\n");

    // Обрабатываем значения
    for (i = 1; i <= 40; i++)
    {
        printf("Введите X (значение %d из 40): ", i);
        scanf("%lf", &x);

        // Проверка диапазона
        if (x < 1 || x > 8)
        {
            printf("Ошибка: показание вне диапазона [1...8] бар.\n\n");
            
        }
        else
        {
            // Подсчеты Q по формуле
            if (x < 2.0)
            {
                Q = 3 * (x - 2) + 10;
            }
            else if (x >= 2.0 && x <= 5.0)
            {
                Q = 2 * sqrt(x - 3.5 + 2) + 45;
            }
            else
            {
                Q = (pow(x - 5, 2) / 1) + 55;
            }

            // Контроль по верхней границе
            if (Q > UCL)
            {
                state = 1; // ПРЕВЫШЕНО ЗНАЧЕНИЕ Q
            }
            else
            {
                state = 0; // НОРМАЛЬНЫЙ Q
            }

            // Вывод результата
            printf("X = %.2f   |   Q = %.2f   |   Состояние: ", x, Q);
            if (state == 0)
            {
                printf("НОРМАЛЬНЫЙ Q\n\n");
            }
            else
            {
                printf("ПРЕВЫШЕНО ЗНАЧЕНИЕ Q\n\n");
            }
        }
    }

    printf("ОБРАБОТКА ЗАВЕРШЕНА\n");
}